Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignSettings Class
 The AnalysisDesignSettings class contains information about analysis design settings.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisDesignSettings
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisDesignSettings
Public Class AnalysisDesignSettings
The AnalysisDesignSettings type exposes the following members.
Constructors
Name | Description
AnalysisDesignSettings
 Creates a new analysis design settings instance.
Top
Properties
Name | Description
ConcreteDesignCode
 The concrete design code.
ConcreteDesignMethod
 The concrete design method.
SteelDesignCode
 The steel design code.
SteelDesignMethod
 The steel design method.
TimberDesignCode
 The timber design code.
TimberDesignMethod
 The timber design method.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace